## 722713121070: ConfigRules
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_config_config_rule.cbs_cloudtrail_enabled will be created
  + resource "aws_config_config_rule" "cbs_cloudtrail_enabled" {
      + arn              = (known after apply)
      + description      = "A Config rule that checks that CloudTrail is enabled and logging to a given bucket."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + s3BucketName = "cbs-satellite-722713121070"
            }
        )
      + name             = "cbs_cloudtrail_enabled"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::CloudTrail::Trail",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUD_TRAIL_ENABLED"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_cloudtrail_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_elb_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_bucket_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_satellite_bucket_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_vpc_flow_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_wafv2_logs_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_config_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.security_config"]

16 tests, 8 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
